Repository: LuizCocada/EstiloMestreSaasAPI
Catalog: src/Shared/EstiloMestre.Exceptions/ExceptionsBase/ResourceMessagesExceptions.*.resx
Languages: pt_br

# NAME_EMPTY
source: Name cannot be empty.
pt_br: Nome não pode ser vazio.

# EMAIL_INVALID
source: Invalid email.
pt_br: Email inválido.

# EMAIL_EMPTY
source: Email cannot be empty.
pt_br: Email não pode ser vazio.

# PASSWORD_EMPTY
source: Password cannot be empty.
pt_br: Senha não pode ser vazia.

# PASSWORD_INVALID
source: invalid password.
pt_br: Senha inválida.

source: Unknow Exception.
pt_br: Error desconhecido.

# EMAIL_ALREADY_EXISTS
source: Email already exist.
pt_br: Email já cadastrado.

source: Email or password invalid.
pt_br: Email ou senha inválido.

# NO_TOKEN
source: token not receive.
pt_br: Token não recebido.

# USER_WITHOUT_PERMISSION_ACCESS_RESOURCE
source: User without permission to access resource.
pt_br: Usuario sem permissão para acessar o recurso.

# BARBERSHOP_NAME_EMPTY
source: Barbershop name cannot be empty
pt_br: Nome da barbearia não pode ser vazio.

# ADDRESS_EMPTY
source: Barbershop Address cannot be empty.
pt_br: Endereço da barbearia nao pode ser vazio.

source: Token expired.
pt_br: Token expirado.

# BARBERSHOP_ID_NOT_FOUND_IN_ROUTE
source: Barbershop id not found in route params
pt_br: Id da barbearia não encontrado nos parametros de rota.

# BARBERSHOP_ID_INVALID_IN_ROUTE
source: Invalid barbershopId in route params
pt_br: Id da barbearia invalido no parametro de rota.

source: User not found.
pt_br: Usuário não encontrado.

source: Employee already registered in this barbershop.
pt_br: Funcionário já registrado nesta barbearia.

# SERVICE_NAME_EMPTY
source: Service name cannot be empty
pt_br: Nome do serviço não pode ser vazio.

source: Service name too long.
pt_br: Nome de serviço muito longo.

source: Service description too long.
pt_br: Descrição de serviço muito longa.

# SERVICE_ALREADY_EXISTS
source: Service already exist.
pt_br: Serviço já registrado.

source: At least one service required.
pt_br: É necessário pelo menos um serviço

# SERVICE_PRICE_INVALID
source: Invalid service price.
pt_br: Preço de serviço inválido.

# SERVICE_DURATION_INVALID
source: Invalid service duration.
pt_br: Tempo de serviço inválido.

# SERVICE_ID_INVALID
source: Invalid service identifier.
pt_br: Identificador de serviço inválido.

# SERVICE_WITH_ID_NOT_FOUND
source: Services with id not found: {0}
pt_br: Serviços com os id não encontrados: {0}

# SERVICE_WITH_ID_ALREADY_REGISTERED
source: service with id is already registered: {0}
pt_br: Serviço com o id já cadastrado: {0}

source: Employee already registered in another barbershop.
pt_br: Funcionário já está registrado em outra barbearia.

# EMPLOYEE_SERVICE_ALREADY_REGISTERED
source: Employe already perform this service.
pt_br: Funcionário já executa esse serviço.

# BARBERSHOP_SERVICE_WITH_ID_NOT_FOUND
source: Barbershop service with not found id.
pt_br: Serviço de barbearia com id não encontrado.

source: Employee Id not found in route.
pt_br: Id do funcionario não encontrado na rota.

source: Employee Id invalid in route.
pt_br: Id de Funcionario invalido na rota.

source: Employee not found.
pt_br: Funcionário não encontrado.
